<h1>Pandas Reintro</h3>

<h3>Pandas Series</h3>

In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a', 'b', 'c']
mylist = [10, 20, 30]
arr = np.array(mylist)
d = {
    'a': 10,
    'b': 20,
    'c': 30
}

In [4]:
d_series = pd.Series(d)
d_series

a    10
b    20
c    30
dtype: int64

In [5]:
salesQ1 = pd.Series(data=[250, 450, 200, 150], index=['USA', 'China', 'India', 'Brazil'])
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [6]:
salesQ2 = pd.Series(data=[210, 480, 220, 130], index=['USA', 'China', 'India', 'Japan'])
salesQ2

USA      210
China    480
India    220
Japan    130
dtype: int64

In [7]:
salesQ2['China']

480

In [8]:
salesQ1 + salesQ2

Brazil      NaN
China     930.0
India     420.0
Japan       NaN
USA       460.0
dtype: float64

<h3>Pandas Dataframe</h3>

In [2]:
import numpy as np
import pandas as pd

In [4]:
columns = ['W', 'X', 'Y', 'Z']

In [12]:
index = ['A', 'B', 'C', 'D', 'E']

In [13]:
from numpy.random import randint

In [14]:
np.random.seed(42)
data = randint(-100, 100, (5, 4))
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [15]:
df = pd.DataFrame(data, index, columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [16]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [17]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [18]:
df['K'] = df.W + df.Y
df

    W   X   Y   Z   K
A   2  79  -8 -86  -6
B   6 -29  88 -80  94
C   2  21 -26 -13 -24
D  16  -1   3  51  19
E  30  49 -48 -99 -18

In [21]:
df.drop('K', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [22]:
df.drop('K', axis=1, inplace=True)

In [23]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [25]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [26]:
df.loc[['C', 'A']]

   W   X   Y   Z
C  2  21 -26 -13
A  2  79  -8 -86

In [4]:
import numpy as np
import pandas as pd

In [5]:
columns = ['W', 'X', 'Y', 'Z']
index = ['A', 'B', 'C', 'D', 'E']

from numpy.random import randint

np.random.seed(42)
data = randint(-100, 100, (5, 4))
data

df = pd.DataFrame(data, index, columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [6]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [8]:
df[df > 0].fillna(0)

    W     X     Y     Z
A   2  79.0   0.0   0.0
B   6   0.0  88.0   0.0
C   2  21.0   0.0   0.0
D  16   0.0   3.0  51.0
E  30  49.0   0.0   0.0

In [9]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [10]:
df.X > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [15]:
df[df.X > 0].iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [17]:
df[(df.W > 0) & (df.Y > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [19]:
df.reset_index(drop=True)

    W   X   Y   Z
0   2  79  -8 -86
1   6 -29  88 -80
2   2  21 -26 -13
3  16  -1   3  51
4  30  49 -48 -99

In [20]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [21]:
df['States'] = new_ind
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [25]:
df.set_index('States')

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [26]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
 4   States  5 non-null      object
dtypes: int64(4), object(1)
memory usage: 412.0+ bytes

In [28]:
df.dtypes

W          int64
X          int64
Y          int64
Z          int64
States    object
dtype: object

<h3>Pandas Missing Data</h3>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, np.nan, 8],
    'C': [10, 20, 30, 40]
})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [4]:
df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [5]:
df.fillna(0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [6]:
df.A = df.A.fillna(df.A.mean())
df

          A    B   C
0  1.000000  5.0  10
1  2.000000  NaN  20
2  2.333333  NaN  30
3  4.000000  8.0  40

In [7]:
df.B = df.B.fillna(df.B.mean())

In [8]:
df

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

<h3>Pandas Group By Operations</h3>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./data_sets/universities.csv')
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [4]:
df.groupby('Year')['Completions'].sum()

Year
2012    20333
2013    21046
2014    24730
2015    26279
2016    26224
Name: Completions, dtype: int64

In [5]:
df.groupby('Year')['Completions'].mean()

Year
2012    535.078947
2013    526.150000
2014    588.809524
2015    597.250000
2016    609.860465
Name: Completions, dtype: float64

In [7]:
df.groupby('Year').Completions.mean().sort_index(ascending=False)

Year
2016    609.860465
2015    597.250000
2014    588.809524
2013    526.150000
2012    535.078947
Name: Completions, dtype: float64

In [10]:
df.groupby(['Year', 'Sector']).Completions.sum()

Year  Sector
2012  Private for-profit, 2-year                  3072
      Private for-profit, 4-year or above          632
      Private for-profit, less-than 2-year        1327
      Private not-for-profit, 2-year               665
      Private not-for-profit, 4-year or above     1059
      Public, 2-year                              1170
      Public, 4-year or above                    12408
2013  Private for-profit, 2-year                  3053
      Private for-profit, 4-year or above          775
      Private for-profit, less-than 2-year        1281
      Private not-for-profit, 2-year               471
      Private not-for-profit, 4-year or above     1016
      Public, 2-year                              1633
      Public, 4-year or above                    12817
2014  Private for-profit, 2-year                  2957
      Private for-profit, 4-year or above         1506
      Private for-profit, less-than 2-year        1328
      Private not-for-profit, 2-year               449
      Private not-for-profit, 4-year or above     1042
      Public, 2-year                              2286
      Public, 4-year or above                    15162
2015  Private for-profit, 2-year                  3280
      Private for-profit, 4-year or above         1306
      Private for-profit, less-than 2-year        1629
      Private not-for-profit, 2-year               425
      Private not-for-profit, 4-year or above     1228
      Public, 2-year                              2355
      Public, 4-year or above                    16056
2016  Private for-profit, 2-year                  3286
      Private for-profit, 4-year or above          748
      Private for-profit, less-than 2-year        1552
      Private not-for-profit, 2-year               322
      Private not-for-profit, 4-year or above     1208
      Public, 2-year                              2431
      Public, 4-year or above                    16677
Name: Completions, dtype: int64

In [11]:
df.groupby('Year').describe()

     Completions
           count        mean          std   min     25%    50%     75%     max
Year
2012        38.0  535.078947  1036.433239  13.0  114.25  229.5  420.50  5388.0
2013        40.0  526.150000  1040.474782   0.0   98.50  189.0  413.00  5278.0
2014        42.0  588.809524  1150.355857   0.0  104.50  203.5  371.75  5093.0
2015        44.0  597.250000  1183.371791   0.0   87.75  191.0  405.75  5335.0
2016        43.0  609.860465  1235.952796   0.0   90.00  208.0  414.00  5367.0

In [12]:
df.groupby('Year').describe().transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

<h3>Pandas Operations</h3>

In [2]:
import numpy as np
import pandas as pd

In [3]:
df_one = pd.DataFrame({
    'k1': ['A', 'A', 'B', 'B', 'C', 'C'],
    'col1': [100,200,300,300,400,500],
    'col2': ['NY', 'CA', 'WA', 'WA', 'AK', 'NV']
})
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [8]:
df_one.k1.unique()

array(['A', 'B', 'C'], dtype=object)

In [7]:
df_one.k1.nunique()

3

In [9]:
df_one.col2.value_counts()

col2
WA    2
NY    1
CA    1
AK    1
NV    1
Name: count, dtype: int64

In [10]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [11]:
df_one['NEW'] = df_one.col1 * 10
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [12]:
def grab_first_letter(state):
    return state[0]

In [13]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [14]:
df_one.col2.apply(grab_first_letter)

0    N
1    C
2    W
3    W
4    A
5    N
Name: col2, dtype: object

In [15]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [16]:
df_one.col2.apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [17]:
df_one.k1

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [18]:
my_map = {
    'A': 1,
    'B': 2,
    'C': 3
}

In [19]:
df_one.k1.map(my_map)

0    1
1    1
2    2
3    2
4    3
5    3
Name: k1, dtype: int64

In [20]:
df_one.col1.max()

500

In [21]:
df_one.col1.idxmax()

5

In [22]:
df_one.col1.min()

100

In [23]:
df_one.col1.idxmin()

0

In [24]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW'], dtype='object')

In [25]:
features = pd.DataFrame({
    'A': [100, 200, 300, 400, 500],
    'B': [12, 13, 14, 15, 16,]
})
predictions = pd.DataFrame({
    'pred': [0, 1, 1, 0, 1]
})

In [26]:
features, predictions

(     A   B
 0  100  12
 1  200  13
 2  300  14
 3  400  15
 4  500  16,
    pred
 0     0
 1     1
 2     1
 3     0
 4     1)

In [28]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [32]:
df_one = df_one.drop('NEW', axis=1)
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV